1c/configuration/InformationRegisters/ТУРВ_ОчередьОбменаСсылочнымиДанными.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ТУРВ_ОчередьОбменаСсылочнымиДанными</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТУРВ_СтатусОбменаСЛК</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботыСотрудников</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыИспользованияРабочегоВремени</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТУРВ_ВидыСобытийСОбъектамиЛК</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1c/configuration/Enums/ТУРВ_ВидыСобытийСОбъектамиЛК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ТУРВ_ВидыСобытийСОбъектамиЛК</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Добавление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изменение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удаление</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1c/configuration/Enums/ТУРВ_СтатусОбменаСЛК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ТУРВ_СтатусОбменаСЛК</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1c/configuration/InformationRegisters/ТУРВ_ОчередьОбменаСсылочнымиДанными/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

#Область РегистрацияДанных

Процедура ЗарегистрироватьДобавлениеОбъекта(ОбъектСсылка) Экспорт 
	
	ИмяМетаданных = ОбъектСсылка.Метаданные().Имя;
	Объект = СтрШаблон(	"{name: ""%1"", object: ""%2""}", 
						ИмяМетаданных, 
						Строка(ОбъектСсылка.УникальныйИдентификатор()));
	
	МенеджерЗаписи             = РегистрыСведений.ТУРВ_ОчередьОбменаСсылочнымиДанными.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект      = ОбъектСсылка;
	МенеджерЗаписи.ВидСобытия  = Перечисления.ТУРВ_ВидыСобытийСОбъектамиЛК.Добавление;
	МенеджерЗаписи.Статус      = Перечисления.ТУРВ_СтатусОбменаСЛК.Новый;
	МенеджерЗаписи.ДатаСобытия = ТекущаяДатаСеанса();
	
	Попытка
		МенеджерЗаписи.Записать();
		
		ТУРВ_ЛогированиеСервер.ДобавитьЗаписьВЛог(	ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Дебаг, 
											ТУРВ_ОбменДаннымиПовтИсп.СобытияЛога().РегистрацияЗаданияОчередиОбмена, 
											ТУРВ_ОбменДаннымиПовтИсп.УровниСобытийЛога().Информация,
											ТУРВ_ЛогированиеСервер.ДанныеJSONОбъектJSON(ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Дебаг,
																				ТУРВ_ЛогированиеСервер.ТекущаяДатаЛК(),
																				,
																				ТУРВ_ОбменДаннымиПовтИсп.ТипыОбъектов().СпрС, 
																				ИмяМетаданных,
																				Объект, 
																				"РегистрыСведений.ТУРБ_ОчередьОбменаСЛКСсылочнымиДанными.ЗарегистрироватьДобавлениеОбъекта"));
	Исключение
		ТУРВ_ЛогированиеСервер.ДобавитьЗаписьВЛог(	ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Ошибка, 
											ТУРВ_ОбменДаннымиПовтИсп.СобытияЛога().РегистрацияЗаданияОчередиОбмена, 
											ТУРВ_ОбменДаннымиПовтИсп.УровниСобытийЛога().Ошибка,
											ТУРВ_ЛогированиеСервер.ДанныеJSONОбъектJSON(ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Ошибка,
																				ТУРВ_ЛогированиеСервер.ТекущаяДатаЛК(),
																				,
																				ТУРВ_ОбменДаннымиПовтИсп.ТипыОбъектов().СпрС, 
																				ИмяМетаданных,
																				Объект, 
																				"РегистрыСведений.ТУРБ_ОчередьОбменаСЛКСсылочнымиДанными.ЗарегистрироватьДобавлениеОбъекта",
																				ОписаниеОшибки()));
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗарегистрироватьИзменениеОбъекта(ОбъектСсылка) Экспорт 
	
	ИмяМетаданных = ОбъектСсылка.Метаданные().Имя;
	Объект = СтрШаблон(	"{name: ""%1"", object: ""%2""}", 
						ИмяМетаданных, 
						Строка(ОбъектСсылка.УникальныйИдентификатор()));
	
	
	МенеджерЗаписи             = РегистрыСведений.ТУРВ_ОчередьОбменаСсылочнымиДанными.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект      = ОбъектСсылка;
	МенеджерЗаписи.ВидСобытия  = Перечисления.ТУРВ_ВидыСобытийСОбъектамиЛК.Изменение;
	МенеджерЗаписи.Статус      = Перечисления.ТУРВ_СтатусОбменаСЛК.Новый;
	МенеджерЗаписи.ДатаСобытия = ТекущаяДатаСеанса();
	
	Попытка		
		МенеджерЗаписи.Записать();
		
		ТУРВ_ЛогированиеСервер.ДобавитьЗаписьВЛог(	ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Дебаг, 
											ТУРВ_ОбменДаннымиПовтИсп.СобытияЛога().РегистрацияЗаданияОчередиОбмена, 
											ТУРВ_ОбменДаннымиПовтИсп.УровниСобытийЛога().Информация,
											ТУРВ_ЛогированиеСервер.ДанныеJSONОбъектJSON(ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Дебаг,
																				ТУРВ_ЛогированиеСервер.ТекущаяДатаЛК(),
																				,
																				ТУРВ_ОбменДаннымиПовтИсп.ТипыОбъектов().СпрС, 
																				ИмяМетаданных,
																				Объект, 
																				"РегистрыСведений.ТУРБ_ОчередьОбменаСЛКСсылочнымиДанными.ЗарегистрироватьИзменениеОбъекта"));
	Исключение
		ТУРВ_ЛогированиеСервер.ДобавитьЗаписьВЛог(	ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Ошибка, 
											ТУРВ_ОбменДаннымиПовтИсп.СобытияЛога().РегистрацияЗаданияОчередиОбмена, 
											ТУРВ_ОбменДаннымиПовтИсп.УровниСобытийЛога().Ошибка,
											ТУРВ_ЛогированиеСервер.ДанныеJSONОбъектJSON(ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Ошибка,
																				ТУРВ_ЛогированиеСервер.ТекущаяДатаЛК(),
																				ТУРВ_ОбменДаннымиПовтИсп.ТипыОбъектов().СпрС,
																				ИмяМетаданных,
																				Объект, 
																				"РегистрыСведений.ТУРБ_ОчередьОбменаСЛКСсылочнымиДанными.ЗарегистрироватьИзменениеОбъекта",
																				ОписаниеОшибки()));
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область ИзменениеСтатуса

Процедура ЗарегистрироватьОшибкуОбработки(ИД, ОбъектСсылка, ВидСобытия, МестоВозникновения = "", Ошибка = "") Экспорт 
	
	ИмяМетаданных = ОбъектСсылка.Метаданные().Имя;
	Объект = СтрШаблон(	"{name: ""%1"", object: ""%2""}", 
						ИмяМетаданных, 
						Строка(ОбъектСсылка.УникальныйИдентификатор()));
	
	МенеджерЗаписи             = РегистрыСведений.ТУРВ_ОчередьОбменаСсылочнымиДанными.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект      = ОбъектСсылка;
	МенеджерЗаписи.ВидСобытия  = ВидСобытия;
	МенеджерЗаписи.Статус      = Перечисления.ТУРВ_СтатусОбменаСЛК.Ошибка;
	МенеджерЗаписи.ДатаСобытия = ТекущаяДатаСеанса();
	
	Попытка	
		МенеджерЗаписи.Записать();
		
		ТУРВ_ЛогированиеСервер.ДобавитьЗаписьВЛог(	ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Ошибка, 
											ТУРВ_ОбменДаннымиПовтИсп.СобытияЛога().ОшибкаОбработкиОчередиОбмена, 
											ТУРВ_ОбменДаннымиПовтИсп.УровниСобытийЛога().Ошибка,
											ТУРВ_ЛогированиеСервер.ДанныеJSONОбъектJSON(ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Ошибка,
																				ТУРВ_ЛогированиеСервер.ТекущаяДатаЛК(),
																				ИД,
																				ТУРВ_ОбменДаннымиПовтИсп.ТипыОбъектов().СпрС, 
																				ИмяМетаданных,
																				Объект, 
																				МестоВозникновения,
																				Ошибка));
	Исключение
		ТУРВ_ЛогированиеСервер.ДобавитьЗаписьВЛог(	ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Ошибка, 
											ТУРВ_ОбменДаннымиПовтИсп.СобытияЛога().ОшибкаОбработкиОчередиОбмена, 
											ТУРВ_ОбменДаннымиПовтИсп.УровниСобытийЛога().Ошибка,
											ТУРВ_ЛогированиеСервер.ДанныеJSONОбъектJSON(ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Ошибка,
																				ТУРВ_ЛогированиеСервер.ТекущаяДатаЛК(),
																				ИД,
																				ТУРВ_ОбменДаннымиПовтИсп.ТипыОбъектов().СпрС, 
																				ИмяМетаданных,
																				Объект, 
																				"РегистрыСведений.ТУРБ_ОчередьОбменаСЛКСсылочнымиДанными.ЗарегистрироватьОшибкуОбработки",
																				ОписаниеОшибки()));
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗарегистрироватьУспехОбработки(ИД, ОбъектСсылка, ВидСобытия) Экспорт 
	
	ИмяМетаданных = ОбъектСсылка.Метаданные().Имя;
	Объект = СтрШаблон(	"{name: ""%1"", object: ""%2""}", 
						ИмяМетаданных, 
						Строка(ОбъектСсылка.УникальныйИдентификатор()));
	
	МенеджерЗаписи             = РегистрыСведений.ТУРВ_ОчередьОбменаСсылочнымиДанными.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект      = ОбъектСсылка;
	МенеджерЗаписи.ВидСобытия  = ВидСобытия;
	МенеджерЗаписи.Статус      = Перечисления.ТУРВ_СтатусОбменаСЛК.Выполнен;
	МенеджерЗаписи.ДатаСобытия = ТекущаяДатаСеанса();
	
	Попытка
		МенеджерЗаписи.Записать();
		
		ТУРВ_ЛогированиеСервер.ДобавитьЗаписьВЛог(	ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Дебаг, 
											ТУРВ_ОбменДаннымиПовтИсп.СобытияЛога().РегистрацияЗаданияОчередиОбмена, 
											ТУРВ_ОбменДаннымиПовтИсп.УровниСобытийЛога().Информация,
											ТУРВ_ЛогированиеСервер.ДанныеJSONОбъектJSON(ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Дебаг,
																				ТУРВ_ЛогированиеСервер.ТекущаяДатаЛК(),
																				ИД, 
																				ТУРВ_ОбменДаннымиПовтИсп.ТипыОбъектов().СпрС,
																				ИмяМетаданных,
																				Объект, 
																				"РегистрыСведений.ТУРБ_ОчередьОбменаСЛКСсылочнымиДанными.ЗарегистрироватьУспехОбработки"));
	Исключение
		ТУРВ_ЛогированиеСервер.ДобавитьЗаписьВЛог(	ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Ошибка, 
											ТУРВ_ОбменДаннымиПовтИсп.СобытияЛога().ОшибкаЛога, 
											ТУРВ_ОбменДаннымиПовтИсп.УровниСобытийЛога().Ошибка,
											ТУРВ_ЛогированиеСервер.ДанныеJSONОбъектJSON(ТУРВ_ОбменДаннымиПовтИсп.УровниЛога().Ошибка,
																				ТУРВ_ЛогированиеСервер.ТекущаяДатаЛК(),
																				ИД, 
																				ТУРВ_ОбменДаннымиПовтИсп.ТипыОбъектов().СпрС,
																				ИмяМетаданных,
																				Объект, 
																				"РегистрыСведений.ТУРБ_ОчередьОбменаСЛКСсылочнымиДанными.ЗарегистрироватьУспехОбработки",
																				ОписаниеОшибки()));
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
